
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 86 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.apim_kv_policy
  * azurerm_key_vault_access_policy.policy
  * azurerm_role_assignment.mi_sa[&#34;Contributor&#34;]
  * azurerm_role_assignment.mi_sa[&#34;Storage Blob Data Contributor&#34;]
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-id&#34;]
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-pwd&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-id&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-apim-cert&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-token&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;health-check-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-base-64&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-ctx&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-gateway-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-auth&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-assignment-group&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-caller-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-role-type&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-service-offering&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-username&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;tenant-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-pwd&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-libra-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;mi-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-name&#34;]
  * module.kv_cft.azurerm_key_vault.kv
  * module.kv_cft.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_cft.azurerm_key_vault_access_policy.developer[0]
  * module.kv_cft.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_key_vault.kv
  * module.kv_crime.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_crime.azurerm_key_vault_access_policy.developer[0]
  * module.kv_crime.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_key_vault.kv
  * module.kv_hmi.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_hmi.azurerm_key_vault_access_policy.developer[0]
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
  * module.kv_hmi.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_key_vault.kv
  * module.kv_rota.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_rota.azurerm_key_vault_access_policy.developer[0]
  * module.kv_rota.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_key_vault.kv
  * module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_snl.azurerm_key_vault_access_policy.developer[0]
  * module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Reader&#34;]
  * module.sa.azurerm_storage_container.container[&#34;libra&#34;]
  * module.sa.azurerm_storage_container.container[&#34;processing&#34;]
  * module.sa.azurerm_storage_container.container[&#34;rota&#34;]
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-id&#34;]
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-pwd&#34;]
* Delete
  * azurerm_automation_account.automation_account
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
* Replace
  * module.sa.azurerm_storage_account.storage_account is tainted, so


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.automation_account will be destroyed
  # (because azurerm_automation_account.automation_account is not in configuration)
  - resource "azurerm_automation_account" "automation_account" {
      - dsc_primary_access_key        = (sensitive value)
      - dsc_secondary_access_key      = (sensitive value)
      - dsc_server_endpoint           = "https://c7f32c02-013a-4fc5-b696-b35cea282cee.agentsvc.uks.azure-automation.net/accounts/c7f32c02-013a-4fc5-b696-b35cea282cee" -> null
      - hybrid_service_url            = "https://c7f32c02-013a-4fc5-b696-b35cea282cee.jrds.uks.azure-automation.net/automationAccounts/c7f32c02-013a-4fc5-b696-b35cea282cee" -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa" -> null
      - local_authentication_enabled  = true -> null
      - location                      = "uksouth" -> null
      - name                          = "hmi-stg-aa" -> null
      - private_endpoint_connection   = [] -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "hmi-sharedinfra-sds-stg-rg" -> null
      - sku_name                      = "Basic" -> null
      - tags                          = {
          - "application"         = "hearings-management-interface"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null

      - identity {
          - identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
            ] -> null
          - principal_id = "8602f1ec-a418-4dfc-b198-08b06554ee2b" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }
    }

  # azurerm_key_vault_access_policy.apim_kv_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_kv_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "86edbf4a-d5aa-4a70-8137-a41ae3e62a62"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_role_assignment.mi_sa["Contributor"] will be created
  + resource "azurerm_role_assignment" "mi_sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_sa["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "mi_sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main will be destroyed
  # (because azurerm_automation_runbook.main is not in configuration)
  - resource "azurerm_automation_runbook" "main" {
      - automation_account_name  = "hmi-stg-aa" -> null
      - content                  = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
                Write-Host "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
                Write-host "Bypass required, add rule for $ip in $key_vault_name"
                Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
              Write-host "Removing rule for $ip in $key_vault_name"
              Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
            }
        EOT -> null
      - description              = "This is a runbook to automate the recycling of SAS tokens on hmisastg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rl" -> null
      - job_schedule             = [] -> null
      - location                 = "uksouth" -> null
      - log_activity_trace_level = 0 -> null
      - log_progress             = true -> null
      - log_verbose              = true -> null
      - name                     = "rotate-sas-tokens-hmisastg-rota-rl" -> null
      - resource_group_name      = "hmi-sharedinfra-sds-stg-rg" -> null
      - runbook_type             = "PowerShell" -> null
      - tags                     = {
          - "application"         = "hearings-management-interface"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be destroyed
  # (because azurerm_automation_schedule.schedule is not in configuration)
  - resource "azurerm_automation_schedule" "schedule" {
      - automation_account_name = "hmi-stg-aa" -> null
      - description             = "This is a schedule to automate the recycling of SAS tokens on hmisastg" -> null
      - expiry_time             = "9999-12-31T23:59:00+00:00" -> null
      - frequency               = "Day" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule" -> null
      - interval                = 1 -> null
      - name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule" -> null
      - resource_group_name     = "hmi-sharedinfra-sds-stg-rg" -> null
      - start_time              = "2023-11-30T01:00:00Z" -> null
      - timezone                = "Etc/UTC" -> null
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be destroyed
  # (because azurerm_automation_schedule.trigger_once is not in configuration)
  - resource "azurerm_automation_schedule" "trigger_once" {
      - automation_account_name = "hmi-stg-aa" -> null
      - description             = "This is a one time trigger to automate the recycling of SAS tokens on hmisastg" -> null
      - expiry_time             = "2023-11-29T10:30:00+00:00" -> null
      - frequency               = "OneTime" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger" -> null
      - name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger" -> null
      - resource_group_name     = "hmi-sharedinfra-sds-stg-rg" -> null
      - start_time              = "2023-11-29T10:30:00Z" -> null
      - timezone                = "Etc/UTC" -> null
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_runbook.main will be destroyed
  # (because azurerm_automation_runbook.main is not in configuration)
  - resource "azurerm_automation_runbook" "main" {
      - automation_account_name  = "hmi-stg-aa" -> null
      - content                  = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSAST

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

         + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "hmi-kv-stg-shared-rota"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.kv_snl.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "hmi-kv-stg-shared-snl"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "hmi-sharedinfra-sds-stg-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "hmi-kv-stg-shared-snl"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.sa.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "storage-account-role-assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8e65726d-ee0f-46e7-9105-f97ab9f5e70b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sa.azurerm_storage_account.storage_account is tainted, so must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "hmisastg"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://hmisastg.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "hmisastg.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://hmisastg.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "hmisastg.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://hmisastg.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "hmisastg.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://hmisastg.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "hmisastg.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://hmisastg.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "hmisastg.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://hmisastg.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "hmisastg.z33.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key              = (sensitive value)
      ~ secondary_blob_connection_string  = (sensitive value)
      ~ secondary_blob_endpoint           = "https://hmisastg-secondary.blob.core.windows.net/" -> (known after apply)
      ~ secondary_blob_host               = "hmisastg-secondary.blob.core.windows.net" -> (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      ~ secondary_dfs_endpoint            = "https://hmisastg-secondary.dfs.core.windows.net/" -> (known after apply)
      ~ secondary_dfs_host                = "hmisastg-secondary.dfs.core.windows.net" -> (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      ~ secondary_location                = "ukwest" -> (known after apply)
      ~ secondary_queue_endpoint          = "https://hmisastg-secondary.queue.core.windows.net/" -> (known after apply)
      ~ secondary_queue_host              = "hmisastg-secondary.queue.core.windows.net" -> (known after apply)
      ~ secondary_table_endpoint          = "https://hmisastg-secondary.table.core.windows.net/" -> (known after apply)
      ~ secondary_table_host              = "hmisastg-secondary.table.core.windows.net" -> (known after apply)
      ~ secondary_web_endpoint            = "https://hmisastg-secondary.z33.web.core.windows.net/" -> (known after apply)
      ~ secondary_web_host                = "hmisastg-secondary.z33.web.core.windows.net" -> (known after apply)
        tags                              = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (19 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.sa.azurerm_storage_container.container["libra"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "libra"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.sa.azurerm_storage_container.container["processing"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "processing"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.sa.azurerm_storage_container.container["rota"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rota"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-pwd"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 86 to add, 0 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"","Vars":{}} -->